Q.1. Small Stocks Dataset

1. Set index on ‘Symbol‘ and 'Date‘, allow inplace changes

In [193]:
import pandas as pd

df=pd.read_csv("Small_stocks.csv")
df

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [194]:
df.columns

Index(['Date', 'Close', 'Volume', 'Symbol'], dtype='object')

In [195]:
df1=df.set_index(["Symbol", "Date"])
df1

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

2. Sort Indexes

In [196]:
df2=df1.sort_index()
df2

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

3. Select data for “AAPL”

In [197]:
df3=df2.loc[["AAPL"]]
df3

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100

4. Select “Close” value for “AAPL” on “2016-10-03”

In [198]:
df4=df2.loc[("AAPL", "2016-10-03"), "Close"]
print(df4)

112.52

5. Select data for Apple and Microsoft

In [199]:
df5=df2.loc[["AAPL", "MSFT"]]
df5

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

6. Select data for Apple and Microsoft for a particular Date

In [200]:
df6=df2.loc[[("AAPL","2016-10-04"),("MSFT","2016-10-04")]]
df6

                    Close    Volume
Symbol Date
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900

7. Select data for apple on multiple dates

In [201]:
df7=df2.loc[[("AAPL","2016-10-03"),("AAPL","2016-10-05")]]
df7

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-05  113.05  21453100

8. Selecting all data for '2016-10-03','2016-10-04‘date

In [202]:
df8=df.set_index(["Date", "Symbol"])
df8

                    Close    Volume
Date       Symbol
2016-10-03 CSCO     31.50  14070500
           AAPL    112.52  21701800
           MSFT     57.42  19189500
2016-10-04 AAPL    113.00  29736800
           MSFT     57.24  20085900
           CSCO     31.35  18460400
2016-10-05 MSFT     57.64  16726400
           CSCO     31.59  11808600
           AAPL    113.05  21453100

In [203]:
df9=df8.loc[['2016-10-03','2016-10-04']]
df9

                    Close    Volume
Date       Symbol
2016-10-03 CSCO     31.50  14070500
           AAPL    112.52  21701800
           MSFT     57.42  19189500
2016-10-04 AAPL    113.00  29736800
           MSFT     57.24  20085900
           CSCO     31.35  18460400

9. Fetch all those rows where Volume>18000000

In [204]:
df9=df[df["Volume"] > 18000000]
df9

         Date   Close    Volume Symbol
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
8  2016-10-05  113.05  21453100   AAPL

Q.2. Grouping and Aggregations

1. Load data and group by Region

In [206]:
data=pd.read_csv("Grouping.csv")
data.head()

        date  gender      region  sales
0  8/22/2022    Male  North-West  20381
1   3/5/2022    Male  North-East  14495
2   2/9/2022    Male  North-East  13510
3  6/22/2022    Male  North-East  15983
4  8/10/2022  Female  North-West  15007

In [210]:
data.columns

Index(['date', 'gender', 'region', 'sales'], dtype='object')

In [218]:
d1=data.groupby(['region'])
d2=d1.first()
d2

                 date gender  sales
region
North-East   3/5/2022   Male  14495
North-West  8/22/2022   Male  20381
South        9/6/2022   Male  21792

2. Counting number of groups

In [227]:
d3=data.agg(['count'])
d3

       date  gender  region  sales
count  1000    1000    1000   1000

3. Accessing the Groups in a GroupBy object

In [235]:
d4=data.groupby('region')
print(d4)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001718382E250>

4. Accessing only Group Names of a GroupBy Object

In [232]:
d5=data.groupby('region').groups.keys()
d5

dict_keys(['North-East', 'North-West', 'South'])

5. Selecting a Group of south region.

In [247]:
d6 = d4.get_group('South') 
d6

           date  gender region  sales  rank_sales
5      9/6/2022    Male  South  21792       109.0
6     8/21/2022    Male  South  20113       127.0
8    11/22/2022    Male  South  14594       158.0
9     1/16/2022  Female  South  24114        94.0
10   12/21/2022    Male  South  35154         4.0
..          ...     ...    ...    ...         ...
972    6/9/2022    Male  South  22254       101.0
979  11/24/2022  Female  South  25591        71.0
981   12/5/2022    Male  South  34334         7.0
985   12/1/2022  Female  South  21282       120.0
994   9/29/2022    Male  South  21255       116.0

[331 rows x 5 columns]

6. Findout average Sales per region

In [248]:
d8 = d4['sales'].mean()
d8

region
North-East    17386.072046
North-West    15257.732919
South         24466.864048
Name: sales, dtype: float64

7. Applying Multiple Aggregations Using Pandas GroupBy - Find out Mean, median and variance of sales per region

In [249]:
d9 = d4['sales'].agg(['mean', 'median', 'var'])
d9

                    mean   median           var
region
North-East  17386.072046  17414.0  4.131225e+06
North-West  15257.732919  15337.5  1.311495e+07
South       24466.864048  24492.0  2.760139e+07

8. Calculate percentage of region's sales per row with respect to total sale of the region

In [250]:
d10= data['sales'] = d4['sales'].transform(lambda x: x / x.sum() * 100)
d10

0      0.414839
1      0.240263
2      0.223936
3      0.264928
4      0.305456
         ...
995    0.285264
996    0.256971
997    0.310196
998    0.330020
999    0.337656
Name: sales, Length: 1000, dtype: float64

9. Filtering Rows Where the Group's Average Sale Price is Less Than 20,000.

In [251]:
d11 = d4.filter(lambda x: x['sales'].mean() < 20000)
d11

           date  gender      region     sales  rank_sales
0     8/22/2022    Male  North-West  0.414839        11.0
1      3/5/2022    Male  North-East  0.240263       154.0
2      2/9/2022    Male  North-East  0.223936       168.0
3     6/22/2022    Male  North-East  0.264928       138.0
4     8/10/2022  Female  North-West  0.305456        89.0
..          ...     ...         ...       ...         ...
995    6/2/2022  Female  North-West  0.285264       102.0
996   5/20/2022  Female  North-East  0.256971       145.0
997    4/2/2022    Male  North-East  0.310196        48.0
998   12/7/2022    Male  North-East  0.330020        22.0
999  12/19/2022  Female  North-West  0.337656        65.0

[1000 rows x 5 columns]

10. Calculate the sum of all sales broken out by 'region' and by 'gender'

In [245]:
d12 = data.groupby(['region', 'gender'])['sales'].sum()
d12

region      gender
North-East  Female    3051132
            Male      2981835
North-West  Female    2455899
            Male      2457091
South       Female    4135688
            Male      3962844
Name: sales, dtype: int64

11. Ranking Sales by Region and by Gender

In [246]:
d13= data['rank_sales'] = data.groupby(['region', 'gender'])['sales'].rank(method='min', ascending=False)
d13

0       11.0
1      154.0
2      168.0
3      138.0
4       89.0
       ...
995    102.0
996    145.0
997     48.0
998     22.0
999     65.0
Name: sales, Length: 1000, dtype: float64